{
  "id": 3,
  "lastMessageAt": "2025-03-06T15:35:41.085Z",
  "participant": {
    "id": 3,
    "username": "julie",
    "displayName": "Julie Moreau",
    "avatar": "https://i.ibb.co/Y7JkzTxR/Julie.png",
    "lastSeen": "2025-03-04T20:17:25.856Z"
  },
  "messages": [
    {
      "id": 3001,
      "conversationId": 3,
      "senderId": 3,
      "type": "text",
      "content": "Salut Madeleine, il faut que je restructure mon équipe de direction (certains execs qui étaient tops jusqu'à présent sont un peu dépassés vu la croissance) mais j'ai peur que ça mette le bazar dans nos opérations.",
      "metadata": {},
      "createdAt": "2025-03-06T15:35:41.085Z",
      "status": "read"
    },
    {
      "id": 3002,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Julie, ca fait un moment que le sujet traîne donc je ne suis pas étonnée. Je sais aussi qu'une fois que tu as pris ta décision tu passes vite en mode action donc prenons un moment pour réfléchir. ",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3003,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "C'est quoi le but de cette décision, qu'est-ce que tu veux obtenir comme résultat en restructurant ?",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3004,
      "conversationId": 3,
      "senderId": 3,
      "type": "audio",
      "content": "/audio/MessageJulie.mp3",
      "metadata": {
        "duration": 76,
        "caption": "Voice message"
      },
      "createdAt": "2025-03-06T14:35:41.085Z",
      "status": "read"
    },
    {
      "id": 3005,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Ok c'est bien reçu. Je travaille dessus et je te propose des options.",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3006,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Ok voilà des pistes :",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3007,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Indra Nooyi (ex CEO de Pespi) te dirait de recruter un talent exceptionnel externe soit au marketing soit pour la fonction produit. C'est ce qu'elle a fait en prenant des leaders de chez 3M. Car quand vous amenez un grand leader, il attire d'autres grands leaders. Ce leader transformationnel créera un effet domino, attirant naturellement d'autres talents exceptionnels et forçant les cadres existants à s'élever ou s'effacer.",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3008,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Peter Drucker te dirait de restructurer ton équipe autour des forces uniques de chaque leader plutôt que des titres traditionnels. Ne cherche pas des execs sans faiblesses mais ceux ayant une force exceptionnelle dans un domaine critique, comme Lincoln l'a fait en choisissant Grant pour ses victoires malgré ses défauts. Redéfinis les responsabilités de chaque membre actuel exclusivement autour de leur force distinctive, en acceptant leurs faiblesses tant qu'elles n'entravent pas cette force principale.",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3009,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Si on regarde du côté de l'IRA pendant la révolution, ils diraient que Julie ne devrait pas restructurer son équipe actuelle mais plutôt créer à côté une structure parallèle innovante. Comme le décrit Robert Lynd à propos de la stratégie irlandaise : Leur politique n'est pas tant d'attaquer le gouvernement que de l'ignorer et d'en bâtir un nouveau à ses côtés. Julie pourrait établir une nouvelle équipe pilote concentrée sur l'avenir, tout en maintenant l'équipe existante pour les opérations actuelles.",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3010,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Si on demande aux US Marines, ils te parleraient du principe de Turning everyone into a star. Tu dois transformer son équipe existante plutôt que de la remplacer. Comme Robert Lutz l'a appris chez les Marines : Les bons leaders sont capables d'obtenir des performances supérieures des personnes déjà en place. Tu devrais se concentrer sur l'élévation des compétences de toute ton équipe actuelle plutôt que sur le recrutement externe, car le cœur du processus n'est pas le recrutement, mais ce que le Corps fait de ses recrues. Un vrai leader ne remplace pas les individus, mais déplace toute la courbe dans la direction de l'excellence - même avec une équipe qui semble avoir atteint ses limites.",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    },
    {
      "id": 3011,
      "conversationId": 3,
      "senderId": 5,
      "type": "text",
      "content": "Quelle piste est-ce que tu veux explorer ? ",
      "metadata": {},
      "createdAt": "2025-03-06T15:05:41.085Z",
      "status": "read"
    }
  ]
}
